--===========================================
--Запрос 1: Общая статистика по магазину
--===========================================
select 
count(*) as кол_во_товаров,
sum(количество) as кол_во_единиц,
sum(цена * количество) as общая_выручка,
avg(цена) as средняя_цена,
count(distinct категория) as кол_во_катег
from товары;

--========================================
--Запрос 2: Анализ по категориям
--========================================
select категория, 
sum(количество) as кол_во_кат,
sum(цена * количество) as выручка_кат,
round(avg(цена), 0) as средняя_цена_кат,
round(sum(цена * количество) * 100.0 / (SELECT SUM(цена * количество) FROM товары), 0) as доля,
case
	when round(sum(цена * количество) * 100.0 / (SELECT SUM(цена * количество) FROM товары), 0) > 40 then 'Основная'
	when round(sum(цена * количество) * 100.0 / (SELECT SUM(цена * количество) FROM товары), 0) between 20 and 40 then 'Важная'
	else 'Дополнительная'
end as статус
from товары
group by категория
order by доля desc;

--========================================
--Запрос 3: Топ-2 товара в каждой категории по выручке
--========================================
with cte1 as
(select название, категория, цена, количество,
цена * количество as выручка
from товары),
cte2 as
(select *,
row_number() over (partition by категория order by выручка desc) as место,
round(выручка * 100.0 / sum(выручка) over (partition by категория), 0) as доля
from cte1
order by категория, место)
select * from cte2
where место = 1
or место = 2;

--========================================
--Запрос 4: Анализ "звёзд" и "аутсайдеров"
--========================================
with cte1 as
(select название, категория, цена,
round((цена * количество) * 100.0 / sum(цена * количество) over (partition by категория), 0) as доля_в_кат
from товары)
select * from cte1
where доля_в_кат > 50;

with cte1 as
(select название, категория, цена, количество,
round(avg(цена) over (partition by категория), 1) as средняя_цена,
round(avg(количество) over (partition by категория), 1) as среднее_количество
from товары)
select * from cte1
where цена < средняя_цена
and количество > среднее_количество;


--========================================
--Запрос 5: Ценовой анализ с LAG/LEAD
--========================================
with cte1 as
(select название, цена, 
lag(цена) over (order by цена desc) as цена_пред,
lag(цена) over (order by цена desc) - цена as разница,
case
	when (lag(цена) over (order by цена desc) - цена) > 20000 then 'Большой скачок'
	when (lag(цена) over (order by цена desc) - цена) between 5000 and 20000 then 'Заметно'
	else 'Плавно'
end as комментарий
from товары)
select * from cte1
where разница > 5000;


--========================================
--Запрос 6: Рекомендации 
--========================================
with cte1 as
(select название, категория, цена, количество,
round(avg(цена) over (partition by категория), 1) as средняя_цена,
round(avg(количество) over (partition by категория), 1) as среднее_количество
from товары)
select *,
case 
	when цена < средняя_цена and количество > среднее_количество then 'Поднять цену'
	when цена > средняя_цена and количество < среднее_количество then 'Снизить цену'
	else 'Как есть'
end as рекомендация
from cte1
order by рекомендация;
